'''
武将台词列表
'''
def dialogue_zhangchangpu():
    dialogue = [
        '严教：性矜严教，明于教训。',
        '严教：会虽童稚，勤见规诲。',
        '省身：君子之行，皆积小以致高大。',
        '省身：居上不骄，制节谨度。',
        '严教：七岁读论语，八岁诵诗经。',
        '严教：前人所著，会需静心品读。',
        '省身：出兵无重器，其势必不久战。',
        '省身：乐则乐矣，然难久也。',
        '严教：会尚年幼，需明诗书礼教。',
        '严教：十五入太学，问四方奇文异训。',
        '省身：奢僭若此，非长守富贵之道。',
        '省身：奢僭无度，吾常疑其不安。',
        '严教：吾惧汝之意怠，故以渐训汝。',
        '严教：学猥则倦，倦则意怠。',
        '省身：今奢僭若此，非长守富贵之道。',
        '省身：若以小善为无益而弗为，此乃小人之事耳。',
        '严教：书卷精妙，需早学勤记。',
        '严教：幼时不学，弱冠智愚。',
        '省身：清新省身，淡然虚静。',
        '省身：三省吾身，方能知清寻源。',
        '严教：诗书辞赋，需样样精通。',
        '严教：宽严相辅，严学宽仁。',
        '省身：定省凊温，笙磬同音。',
        '省身：省烦从简，烦扰皆除。',
        '严教：教子以空言，得祚果不良。',
        '严教：教子以义方，弗纳于邪。',
        '省身：人不思过往，则难自省其身。',
        '省身：人当自省其身，常思己过。',
        '严教：性情不稳，教诲指引。',
        '严教：幼儿顽劣，需严加管教。',
        '省身：寒宫斗婵娟，吾省夜夜长。',
        '省身：秋月金桂香，独省思如霜。',
        '严教：如切如磋，如琢如磨。',
        '严教：吾儿聪慧，亦须严加教诲。',
        '省身：安不忘危，盛必虑衰。',
        '省身：静心省心，方知万物变通。',
        '抵诽：称病不见，待其自露马脚。'
        '抵诽：孙氏之诽，伤不到我分毫。'
        '严教：此篇未记，会儿便不可嬉戏。',
        '严教：母亲虽严，却皆为汝好。'
    ]
    return dialogue

def dialogue_mizhu():
    dialogue = [
        '资援：区区薄礼，万望使君笑纳。',
        '资援：雪中送炭，以解君愁。',
        '巨贾：君子爱财，取之有道。',
        '巨贾：钱？要多少有多少！',
        '资援：自古得道者多助。',
        '资援：绵薄之力，以助军资。',
        '巨贾：用钱能解决的都不是问题。',
        '巨贾：钱不是万能的，但没钱是万万不能的。',
        '资援：拿去花，别客气！',
        '资援：为义舍财，有何不可！',
        '巨贾：有钱，就是这么任性。',
        '巨贾：钱只是手段，从来都不是目的。',
        '资援：忠厚具承，性喜资援。',
        '资援：施舍之道，宜无殊典。',
        '巨贾：金玉其车，文错其服。',
        '巨贾：虚估之利，皆入巨贾。',
        '资援：谁无虎落平川之日。',
        '资援：钱财乃身外之物。',
        '巨贾：手握重财，以待明主。',
        '巨贾：世代经营，方能富甲徐州。',
        '资援：千石粟，万两金，寿麋所予尽所求！',
        '资援：五花马，千金裘，尽助玄德谋王侯！',
        '巨贾：居东海之滨，聚天下之利！',
        '巨贾：寿麋商行天下，家资富可敌国！',
        '资援：锦上添花，不若雪中送炭。',
        '资援：乐善好施，仗义疏财。',
        '巨贾：东海豪富，钱财聚亿，僮客万人！',
        '巨贾：余颇有资财，可助公成大事！'
    ]
    return dialogue

if __name__ == '__main__':
    dialogue = dialogue_zhangchangpu()
    dialogue = dialogue_mizhu()
    print(dialogue)
